# Лабораторна робота №2
# Варіант №14

# Використовувати файл frogs.csv

# Перелік завдань:
#   Завдання №1:
#     Яка середня кількість місць для розмноження жаб?
#   Завдання №2:
#     Перевірити чи нормально розподілена висота.
#   Завдання №3:
#     Чи є зв’язок між кількістю місць для розмноження та середньою максимальною температурою?
#   Завдання №4:
#     Побудувати лінійну регресійну модель залежності кількості можливих груп для розмноження від висоти.

import numpy as np
import pandas as pd
from scipy import stats
import seaborn as sns
from sklearn.linear_model import LinearRegression

frogs_data = pd.read_csv('frogs.csv')

# Завдання №1
#   Яка середня кількість місць для розмноження жаб?
print("\n=========================================================================================================")
print("Завдання №1\n")

mean_NoOfSites = frogs_data['NoOfSites'].mean()
print(f"Середня кількість місць для розмноження жаб: {mean_NoOfSites}")


# Завдання №2
#   Перевірити чи нормально розподілена висота.
print("=========================================================================================================")
print("Завдання №2\n")

k2, p = stats.normaltest(frogs_data['altitude'])
alpha = 0.05
if p < alpha:
    print(f"Висота не розподілена нормально (p = {p})")
else:
    print(f"Висота розподілена нормально (p = {p})")


# Завдання №3
#  Чи є зв’язок між кількістю місць для розмноження та середньою максимальною температурою?
print("=========================================================================================================")
print("Завдання №3\n")
#correlation = frogs_data['NoOfSites'].corr(frogs_data['meanmax'])
#print(f"Кореляція між кількістю місць для розмноження та середньою максимальною температурою: {correlation}")

correlation, cvalue = stats.pearsonr(frogs_data['NoOfSites'], frogs_data['meanmax'])
print(f"Кореляція між кількістю місць для розмноження та середньою максимальною температурою: {correlation}")


# Завдання №4
#   Побудувати лінійну регресійну модель залежності кількості можливих груп для розмноження від висоти.
print("=========================================================================================================")
print("Завдання №4\n")
#X = frogs_data['altitude'].values.reshape(-1,1)
#y = frogs_data['NoOfPools'].values.reshape(-1,1)
#reg = LinearRegression().fit(X, y)
#print(f"Коефіцієнт: {reg.coef_}, Перехід: {reg.intercept_}")

xx = frogs_data['altitude']
yy = frogs_data['NoOfPools']

print(f"Нахил лінії регресії, β1: {stats.linregress(xx,yy).slope}")
print(f"Перетин лінії регресії, β0: {stats.linregress(xx,yy).intercept}")
print(f"Коефіцієнт кореляції: {stats.linregress(xx,yy).rvalue}")
print(f"р-значення тесту: {stats.linregress(xx,yy).pvalue}")
print(f"Середнє квадратичне відхилення середнього арифметичного нахилу: {stats.linregress(xx,yy).stderr}")
print(f"Середнє квадратичне відхилення середнього арифметичного перетину: {stats.linregress(xx,yy).intercept_stderr}")
print("=========================================================================================================\n")